import Foundation


// MARK: - task1
/* შექმენით Genre ტიპის enum, რომელიც შეიცავს ფილმის ჟანრებს, მაგალითად: action, drama, comedy, thriller და სხვა. შექმენით ძირითადი კლასი Film, რომელსაც ექნება შემდეგი თვისებები:
 title - ფილმის სახელი,
 releaseYear— გამოშვების წელი,
 genre — ფილმის ჟანრი,

 revenue - შემოსავალი
 მეთოდი description(), რომელიც დაბეჭდავს ინფორმაციას ფილმზე. */
// MARK: - task2
/*შექმენით კლასი Person, რომელსაც აქვს შემდეგი თვისებები:
 
 name — პიროვნების სახელი
 birthYear — დაბადების წელი.

 მეთოდი getAge რომელიც დაიანგარიშებს და დააბრუნებს ამ პიროვნების ასაკს მოცემულ წელს. */
// MARK: - task3
/*  Film კლასში შექმენით ფუნქცია removeFilm რომელიც პარამეტრად მიიღებს ფილმების მასივს და დასახელებას, ფუნქციამ უნდა წაშალოს მასივში თუ მოიძებნა მსგავსი დასახელების ფილმი.*/
// MARK: - task4
/*შექმენით კლასი Actor, რომელიც არიას Person კლასის მემკვიდრე კლასი
 
 Actor-ს უნდა ჰქონდეს actedFilms  მსახიობის მიერ ნათამაშები ფილმების სია და მეთოდი რომელიც მსახიობის მიერ ნათამაშებ ფილმებს დაამატებს სიაში.*/
// MARK: - task5
/*შექმენი Director კლასი, რომელიც ასევე Person-ის მემკვიდრეა და ექნება directedFilms რეჟისორის მიერ გადაღებული ფილმების სია და totalRevenue რეჟისორის ჯამური შემოსავალი.
 
 დაამატე მეთოდი რომელიც რეჟისორის მიერ გადაღებულ ფილმებს დაამატებს და დაითვლის თითოეული ფილმისთვის ჯამურ შემოსავალს.

*/
// MARK: - task6
/*შექმენით 5 ფილმის ობიექტი და Dictionary, რომელშიც key იქნება მსახიობის სახელი, ხოლო მნიშვნელობებად მიიღებს იმ ფილმების სიას, რომლებშიც მონაწილეობს ეს მსახიობი. */
// MARK: - task7
/* გამოიყენეთ map, იმისთვის რომ დაბეჭდოთ ყველა ფილმის სათაურების სია ამავე ფილმების მასივიდან*/
// MARK: - task8
/* reduce ფუნქციის გამოყენებით დაიანგარიშეთ ამ ყველა ფილმების გამოშვების საშუალო წელი.*/



// MARK: - BOUNS
// MARK: - task9
/* შექმენით კლასი SuperHero, რომელიც შეიცავს შემდეგ ველებს:
 
 name სუპერ გმირის სახელი
 superPower  სუპერ ძალა
 level - PowerLevel enum-ის ტიპის,
 და allies ამავე ტიპის მოკავშირეების ჩამონათვალი,
 დაამატეთ ინიციალიზაციის და დეინიციალიზაციის მეთოდები.*/

// MARK: - task10

/*  შექმენით Enum PowerLevel, რომელიც მოიცავს შემდეგ დონეებს: weak, average, strong, super და დაამატეთ აღწერის მეთოდი რომელიც დააბრუნებს level-ს ტექსტური ფორმით.   */
// MARK: - task11

/*  uniquePowers ყველა გმირისათვის და დააბრუნებს  უნიკალური ძალების სიას  */

// MARK: - task12

/*  მეთოდი addAlly დაამატებს მოკავშირეების სიას, შექმენით 2 SuperHero ობიექტი და გახადეთ ისინი მოკავშირეები.  */






