//
//  InterfaceSegregation.swift
//  SOLID
//
//  Created by Apple on 13.11.24.
//

import Foundation


//ამიტპ არასწორი მაგალითის ხარჯზე ვიტყვი რო თუ მექნებოდა პროტოკოლი ერთი კონკრეტული მოქმედებისა ანუ მაგალითად მომუშავე ტიპი მჭმელი ტიპი...
//მაშინ მე უკვე პროტოკოლებს მივანიჭებდი , და თუ ახალი შესაძლებლობა დამემატებოდა ახალ პროტოკოლს შევქმნიდი

protocol Workable {
    func work()
}

protocol Eatable {
    func eat()
}

class HumanWorker: Workable, Eatable {
    func work() {
    }
    
    func eat() {
    }
}

class RobotWorker: Workable {
    func work() {
        print("მე ვერ ვჭამ დ")
    }
}


//რო შევაჯამო მე პროტოკოლებად დავყავი ქმედებები , ერთი ტიპი "გამგე აღარ არი" მე ისე დავყავი რო ყველაფერი ერთ ქცევაში როარყოფილიყო გაერთიანბული

// ისე ოფშენალით რო გავყოლოდი იგივე შედეგს მივიღებდი მარა მტავარი ფოინთი აქ ქცევების დაყოფაა!


